In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [3]:
s1,s2,s3

(array([4, 5, 4, 2, 7]), array([4, 0, 4, 9, 8]), array([3, 5, 2, 6, 8]))

In [4]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}
sozluk

{'var1': array([4, 5, 4, 2, 7]),
 'var2': array([4, 0, 4, 9, 8]),
 'var3': array([3, 5, 2, 6, 8])}

In [5]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     4     4     3
1     5     0     5
2     4     4     2
3     2     9     6
4     7     8     8

In [6]:
df[0:1]

   var1  var2  var3
0     4     4     3

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     4     4     3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

Ön tanımlı olarak gelen indeks değerlerine(satır değerleri) index metoduyla ulaşıp değiştirdik

In [9]:
df["c":"e"]

   var1  var2  var3
c     4     4     2
d     2     9     6
e     7     8     8

slicing işlemi ile c indeksli elemandan e indeksli elemana kadar ulaştık. String indeksleme olduğu için stop noktası da dahil edilir

### Silme

### Silme

In [10]:
df

   var1  var2  var3
a     4     4     3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

In [11]:
df.drop("a")

   var1  var2  var3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

* drop metodunda axis parametresi otomatik olarak "0" atanır
* yani axis=0 iken silme işlemi gerçekleştirirken satır bazlı silme işlemi gerçekleştirilir
* eğer sütun bazlı silme işlemi gerçekleştirmek istiyorsak axis parametresi 1 olarak girilmelidir

In [12]:
df

   var1  var2  var3
a     4     4     3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

**drop metoduyla yapılan silme işlemleri, ana pandas dataframeine etki etmez.** Eğer ana dataframe üzerinde kalıcı bir etkisi olsun istiyorsak inplace parametresini kullanmalıyız

In [13]:
df

   var1  var2  var3
a     4     4     3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

In [14]:
df.drop("a",axis = 0, inplace = True)

In [15]:
df

   var1  var2  var3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

inplace parametresini True yaparak yaptığımız silme işleminin ana dataframe üzerinde kalıcı etki etmesini sağlarız

In [16]:
l = ["c","e"]

In [17]:
df.drop(l,axis = 0)

   var1  var2  var3
b     5     0     5
d     2     9     6

Fancy indeks ile iki satırı birden sildik. inplace parametresi default olarak False atandığı için ana dataframe üzerinde kalıcı bir etki sağlamadı

### Değişken İşlemleri

In [20]:
"var1" in df # var1 değişkeninin df dataframei içerisinde olup olmadığını sorguladık

True

In [21]:
l = ["var1","var4","var2"]

In [24]:
for i in l:
    print(i in df)
    # for döngüsü ile listeye attığmız her bir değişkenin df dataframe içinde bulunup bulunmadığını sorguladık

True
False
True

In [25]:
df

   var1  var2  var3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

In [26]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
b     5     0     5       inf
c     4     4     2  1.000000
d     2     9     6  0.222222
e     7     8     8  0.875000

var1 değişkenindeki değerleri var2 değişkenindeki değerlere bölerek var4 adında yeni oluşturduğumuz değişkenin değerlerini belirledik

Dikkat edersek b satırındaki işlemde payda 0 olduğu için bölme işlemi gerçekleşememiştir

#### Değişken Silmek

In [27]:
df.drop("var4",axis = 1)

   var1  var2  var3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

axis parametresini 1 yaparak var4 değişkeninin bulunduğu sütunu sildik

In [30]:
df
# inplace parametresini True yapmadığımız için ana dataframe üzerinde kalıcı bir etkisi olmayacaktır

   var1  var2  var3      var4
b     5     0     5       inf
c     4     4     2  1.000000
d     2     9     6  0.222222
e     7     8     8  0.875000

In [31]:
df.drop("var4",axis = 1,inplace = True)

In [33]:
df
# inplace parametresini True yaparak ana dataframe üzerinde kalıcı bir etkisi olmasını sağladık

   var1  var2  var3
b     5     0     5
c     4     4     2
d     2     9     6
e     7     8     8

In [34]:
fl = ["var1","var2"]

In [36]:
df.drop(fl,axis = 1)

   var3
b     5
c     2
d     6
e     8

Fancy indeks ile yine toplu bir değişken silme işlemi gerçekleştirdik